tutorials/multiphase/compressibleInterDyMFoam/laminar/sphereDrop/0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/dynamicMeshDict"
#include "$FOAM_CASE/system/blockMeshDict"

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    farFieldWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sphere
    {
        type            sixDoFRigidBodyDisplacement;
        centreOfMass    (0 $:sphereCentreHeight 0);
        momentOfInertia (2e-3 2e-3 2e-3);
        velocity        (0 -3.77 0);
        accelerationRelaxation  1;
        accelerationDamping     1;

        mass            2.08e-3;  // sphere mass 0.15 kg, 5 degree wedge
//      rhoInf          -1;       // needed only for solvers solving for
                                  // kinematic pressure
        report          on;

        constraints
        {
            maxIterations   500;

            fixedLine1
            {
                sixDoFRigidBodyMotionConstraint line;
                centreOfRotation (0 0.147 0);
                direction       (0 1 0);
            }

            fixedOrientation1
            {
                sixDoFRigidBodyMotionConstraint orientation;
            }
        }

        solver
        {
            type Newmark;
        }

        value           uniform ( 0 0 0 );
    }
    innerAMI
    {
        type            cyclicAMI;
    }
    outerAMI
    {
        type            cyclicAMI;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
